Revit 2018 API
OverrideGraphicSettings.SetProjectionFillColor Method
 Sets the projection surface fill color.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2014
Syntax
C#
public OverrideGraphicSettings SetProjectionFillColor(
	Color color
)
Visual Basic
Public Function SetProjectionFillColor ( _
	color As Color _
) As OverrideGraphicSettings
Visual C++
public:
OverrideGraphicSettings^ SetProjectionFillColor(
	Color^ color
)
Parameters
color
Type: Autodesk.Revit.DB.Color
 Value of the projection surface fill color for the override. InvalidColorValue means no override is set.
Return Value
 Reference to the changed object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace